var answer = document.getElementById("answer");
var submit = document.getElementById("submit");
var question = document.getElementById("question");
var data = document.getElementById("data");
var result = document.getElementById("results");
var next = document.getElementById("next");
var kaisetu = document.getElementById("kaisetu");

var quiz = [
    [57, "奴国王が後漢に使いを送り、金印を授かる"],
    [239, "卑弥呼が魏に使いを送る"],
    [538, "百済の聖明王が仏教を伝える"],
    [593, "聖徳太子が推古天皇の摂政となる"/*, "コックさんと覚えましょう"*/],
    [603, "冠位十二階"],
    [604, "十七条の憲法"],
    [607, "小野妹子らを遣隋使として派遣する"/*, "群れなす遣隋使と覚えましょう"*/],
    [630, "第一回遣唐使(犬上御田鍬(いぬかみのみたすき)ら)"],
    [645, "大化の改新が始まる"],
    [663, "白村江の戦い"],
    [672, "壬申の乱"],
    [694, "持統天皇が藤原京に遷都"],
    [701, "大宝律令"],
    [708, "和同開珎"],
    [710, "元明天皇が平城京に遷都"],
    [723, "三世一身の法"],
    [743, "墾田永年私財法\n大造造立の詔"],
    [752, "東大寺大仏の完成"],
    [794, "桓武天皇が平安京に遷都"],
    [797, "坂上田村麻呂が征夷大将軍になる"],
    [805, "最澄が唐から帰国"],
    [806, "空海が唐から帰国"],
    [866, "藤原良房が摂政となる"],
    [887, "藤原基経が関白になる"],
    [894, "菅原道真が遣唐使を停止する"],
    [939, "平将門の乱\n藤原純友の乱"],
    [1016, "藤原道長が摂政になる"],
    [1051, "前九年合戦"],
    [1083, "後三年合戦"],
    [1086, "白河上皇が院政を始める"],
    [1156, "保元の乱"],
    [1159, "平治の乱"],
    [1185, "壇ノ浦の戦い\n守護・地頭の設置"],
    [1192, "源頼朝が征夷大将軍となる"],
    [1221, "承久の乱\n六波羅探題の設置"],
    [1232, "御成敗式目(貞永式目(じょうえいしきもく))"],
    [1274, "文永の役"],
    [1281, "弘安の役"],
    [1297, "永仁の徳政令"],
    [1333, "鎌倉幕府の滅亡"],
    [1334, "後醍醐天皇が建武の新政を始める"],
    [1336, "南北朝時代が始まる"],
    [1338, "足利尊氏が室町幕府を開く"],
    [1392, "南北朝の合一"],
    [1404, "勘合貿易の開始"],
    [1428, "正長の土一機"],
    [1467, "応仁の乱"],
    [1485, "山城(やましろ)の国一機"],
    [1488, "加賀の一向一揆"],
    [1543, "鉄砲の伝来"],
    [1549, "キリスト教の伝来"],
    [1560, "桶狭間の戦い"],
    [1573, "鎌倉幕府の滅亡"],
    [1575, "長篠(ながしの)の戦い"],
    [1582, "天正遣欧使節\n本能寺の変\n太閤(たいこう)検地"],
    [1588, "刀狩令"],
    [1590, "豊臣秀吉の全国統一"],
    [1592, "文禄の役"],
    [1597, "慶長の役"],
    [1600, "リーフデ号漂着\n関ヶ原の戦い"],
    [1603, "徳川家康が江戸幕府を開く"],
    [1613, "全国に禁教令"],
    [1615, "大坂夏の陣\n武家諸法度(元和令(げんなれい))\n禁中並公家諸法度(きんちゅうならびにくげしょはっと)"],
    [1635, "参勤交代の制度化"],
    [1637, "島原・天草(あまくさ)一機(島原の乱)"],
    [1639, "ポルトガル船の来航禁止(鎖国の完成)"],
    [1641, "オランダ商館が平戸から出島へ移動"],
    [1685, "生類憐みの令(徳川綱吉)"],
    [1709, "正徳の治(新井白石)"],
    [1716, "享保の改革が始まる(徳川吉宗)"],
    [1787, "寛政の改革が始まる(松平定信)"],
    [1792, "ラクスマンが根室に来航"],
    [1808, "フェートン号事件"],
    [1825, "外国船打払令(異国船打払令)"],
    [1837, "大塩の乱\nモリソン号事件"],
    [1839, "蛮社(ばんしゃ)の獄"],
    [1840, "アヘン戦争"],
    [1841, "天保の改革が始まる(水野忠邦)"],
    [1853, "ペリーが浦賀に来航"],
    [1854, "日米和親条約"],
    [1858, "日米修好通商条約\n安政の大獄"],
    [1860, "桜田門外の変"],
    [1862, "生麦事件"],
    [1863, "薩英戦争"],
    [1866, "薩長同盟の成立"],
    [1867, "大政奉還\n王政復古の大号令"],
    [1868, "戊辰戦争\n五箇条の御誓文\n明治元年"],
    [1869, "版籍奉還\n東京遷都"],
    [1871, "廃藩置県\n日清修好条規\n岩倉使節団の派遣"],
    [1872, "学制\n鉄道開通\n富岡製糸場の操業開始"],
    [1873, "徴兵令\n地租改正"],
    [1874, "民選議員設立の建白書"],
    [1875 , "樺太・千島交換条約\n江華島(こうかとう)事件"],
    [1876, "日朝修好条規"],
    [1877, "西南戦争"],
    [1880, "国会期成同盟"],
    [1881, "国会開設の詔\n自由党の結成"],
    [1882, "立憲改進党の結成"],
    [1883, "鹿鳴館の開館"],
    [1884, "秩父事件"],
    [1885, "内閣制度の創設"],
    [1886, "ノルマントン号事件"],
    [1889, "大日本帝国憲法の発布(2月11日)"],
    [1890, "第一回衆議院議員総選挙\n教育勅語の発布\n第一回帝国会議"],
    [1894, "領事裁判権(治外法権)の撤廃(陸奥宗光)\n日清戦争の開始"],
    [1895, "下関条約\n三国干渉"],
    [1901, "八幡製鉄所の操業開始"],
    [1902, "日英同盟"],
    [1904, "日露戦争の開始"],
    [1905, "ポーツマス条約"],
    [1910, "韓国併合"],
    [1911, "関税自主権の回復(小村寿太郎)\n青鞜社の結成(平塚らいてう(平塚雷鳥))"],
    [1912, "大正元年\n第一次護憲運動\n中華民国の成立"],
    [1914, "サラエボ事件\n第一次世界大戦の開始"],
    [1915, "(対華)二十一か条の要求"],
    [1918, "シベリア出兵\n米騒動\n原敬内閣成立"],
    [1919, "パリ講和会議\nベルサイユ条約"],
    [1920, "国際連盟の成立"],
    [1922, "全国水平社の創立\nソ連の成立"],
    [1923, "関東大震災(9月1日)"],
    [1924, "第二次護憲運動"],
    [1925, "ラジオ放送の開始\n治安維持法\n普通選挙法"],
    [1926, "昭和元年"],
    [1929, "世界恐慌"],
    [1231, "満州事変"],
    [1932, "満州国建国\n五・一五事件"],
    [1933, "国際連盟からの脱退を通告"],
    [1936, "二・二六事件"],
    [1937, "日中戦争の開始\n南京事件"],
    [1938, "国家総動員法"],
    [1939, "第二次世界大戦の開始"],
    [1940, "日独伊三国同盟\n大政翼賛会"],
    [1941, "日ソ中立条約\n太平洋戦争の開始"],
    [1945, "広島(8月6日)・長崎(8月9日)に原爆投下\nポツダム宣言の受け入れ"],
    [1946, "日本国憲法の発布(11月3日)"],
    [1947, "日本国憲法の施行(5月3日)"],
    [1948, "世界人権宣言"],
    [1949, "中華人民共和国の成立"],
    [1950, "朝鮮戦争の開始\n警察予備隊の設置"],
    [1951, "サンフランシスコ平和条約\n日米安全保障条約"],
    [1954, "第五福竜丸事件\n自衛隊の発足"],
    [1955, "第一回原水爆禁止世界大会(広島)\n自由民主党の結成"],
    [1956, "日ソ共同宣言\n国際連合へ加盟"],
    [1960, "日米新安全保障条約\n国民所得倍増計画"],
    [1964, "東海道新幹線の開通\n東京オリンピック開催"],
    [1965, "ベトナム戦争(北爆開始)\n日韓基本条約"],
    [1967, "公害対策基本法"],
    [1968, "小笠原諸島返還"],
    [1971, "環境庁の設置"],
    [1972, "沖縄復帰\n国連人間環境会議\n日中共同声明"],
    [1973, "第一次石油危機(第一次オイルショック)"],
    [1978, "日中平和友好条約"],
    [1985, "男女雇用機会均等法の制定"],
    [1988, "青函トンネルの開通\n瀬戸大橋の開通"],
    [1989, "平成元年\n消費税(3%)の実施\nマルタ会談"],
    [1990, "東西ドイツ統一"],
    [1991, "湾岸戦争\n牛肉・オレンジ輸入自由化\nソ連解体"],
    [1992, "国連環境開発会議(地球サミット)\nPKO協力法成立"],
    [1993, "55年体制の崩壊\n環境基本法"],
    [1995, "阪神・淡路大震災(1月7日)"],
    [1997, "消費税5%になる\n京都議定書"],
    [2001, "1府12省庁スタート\nアメリカ同時多発テロ"],
    [2002, "環境開発サミット"],
    [2003, "イラク戦争"],
    [2009, "裁判員制度"],
    [2011, "東日本大震災(3月11日)"],
    [2014, "消費税8%になる"],
    [2015, "選挙権が18歳以上となる"],
    [2019, "令和元年\n消費税10%になる(軽減税率も導入)"],
    [2022, "ロシアのウクライナ進行(2月24日)"],
];

function quizstart() {
    next.style.display = "none";
    answer.value = "";
    var index = Math.floor(Math.random()*quiz.length);
    question.innerText = quiz[index][1];
    if (quiz[index][2] != undefined) {
        data.value = `${quiz[index][0]}, ${quiz[index][2]}`;
    } else {
        data.value = `${quiz[index][0]}`;
    }
};

submit.addEventListener("click", () => {
    next.style.display = "inline";
    if (answer.value == data.value) {
        result.style.color = "red";
        result.innerText = "正解！";
    } else {
        result.style.color = "blue";
        result.innerText = "不正解..."
    }
    answer.disabled = "none";
    kaisetu.innerText = `答え${data.value.split(",")[0]}年`;
    if (data.value.split(",")[2] != undefined) {
        kaisetu.innerText += `\n${data.value.split(",")[2]}`;
    }
})

next.addEventListener("click", () => {
    answer.disabled = "";
    result.innerText = "";
    kaisetu.innerText = "";
    quizstart();
})

quizstart()